/* automatically generated by rust-bindgen 0.60.1 */

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 31;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __LONG_DOUBLE_USES_FLOAT128: u32 = 0;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;

pub const INT_LEAST8_MIN: i32 = -128;
pub const INT_LEAST16_MIN: i32 = -32768;
pub const INT_LEAST32_MIN: i32 = -2147483648;
pub const INT_LEAST8_MAX: u32 = 127;
pub const INT_LEAST16_MAX: u32 = 32767;
pub const INT_LEAST32_MAX: u32 = 2147483647;
pub const UINT_LEAST8_MAX: u32 = 255;
pub const UINT_LEAST16_MAX: u32 = 65535;
pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const __bool_true_false_are_defined: u32 = 1;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    fn test_field___val() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__fsid_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__fsid_t),
                "::",
                stringify!(__val)
            )
        );
    }
    test_field___val();
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NativeSymbol {
    pub symbol: *const ::std::os::raw::c_char,
    pub func_ptr: *mut ::std::os::raw::c_void,
    pub signature: *const ::std::os::raw::c_char,
    pub attachment: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_NativeSymbol() {
    assert_eq!(
        ::std::mem::size_of::<NativeSymbol>(),
        32usize,
        concat!("Size of: ", stringify!(NativeSymbol))
    );
    assert_eq!(
        ::std::mem::align_of::<NativeSymbol>(),
        8usize,
        concat!("Alignment of ", stringify!(NativeSymbol))
    );
    fn test_field_symbol() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NativeSymbol>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).symbol) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(NativeSymbol),
                "::",
                stringify!(symbol)
            )
        );
    }
    test_field_symbol();
    fn test_field_func_ptr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NativeSymbol>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).func_ptr) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(NativeSymbol),
                "::",
                stringify!(func_ptr)
            )
        );
    }
    test_field_func_ptr();
    fn test_field_signature() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NativeSymbol>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).signature) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(NativeSymbol),
                "::",
                stringify!(signature)
            )
        );
    }
    test_field_signature();
    fn test_field_attachment() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<NativeSymbol>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).attachment) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(NativeSymbol),
                "::",
                stringify!(attachment)
            )
        );
    }
    test_field_attachment();
}
extern "C" {
    #[doc = " Get the exported APIs of base lib"]
    #[doc = ""]
    #[doc = " @param p_base_lib_apis return the exported API array of base lib"]
    #[doc = ""]
    #[doc = " @return the number of the exported API"]
    pub fn get_base_lib_export_apis(p_base_lib_apis: *mut *mut NativeSymbol) -> u32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WASMModuleCommon {
    _unused: [u8; 0],
}
pub type wasm_module_t = *mut WASMModuleCommon;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WASMModuleInstanceCommon {
    _unused: [u8; 0],
}
pub type wasm_module_inst_t = *mut WASMModuleInstanceCommon;
pub type WASMFunctionInstanceCommon = ::std::os::raw::c_void;
pub type wasm_function_inst_t = *mut WASMFunctionInstanceCommon;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wasm_section_t {
    pub next: *mut wasm_section_t,
    pub section_type: ::std::os::raw::c_int,
    pub section_body: *mut u8,
    pub section_body_size: u32,
}
#[test]
fn bindgen_test_layout_wasm_section_t() {
    assert_eq!(
        ::std::mem::size_of::<wasm_section_t>(),
        32usize,
        concat!("Size of: ", stringify!(wasm_section_t))
    );
    assert_eq!(
        ::std::mem::align_of::<wasm_section_t>(),
        8usize,
        concat!("Alignment of ", stringify!(wasm_section_t))
    );
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<wasm_section_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(wasm_section_t),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
    fn test_field_section_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<wasm_section_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).section_type) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(wasm_section_t),
                "::",
                stringify!(section_type)
            )
        );
    }
    test_field_section_type();
    fn test_field_section_body() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<wasm_section_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).section_body) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(wasm_section_t),
                "::",
                stringify!(section_body)
            )
        );
    }
    test_field_section_body();
    fn test_field_section_body_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<wasm_section_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).section_body_size) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(wasm_section_t),
                "::",
                stringify!(section_body_size)
            )
        );
    }
    test_field_section_body_size();
}
pub type aot_section_t = wasm_section_t;
pub type wasm_section_list_t = *mut wasm_section_t;
pub type aot_section_list_t = *mut wasm_section_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WASMExecEnv {
    _unused: [u8; 0],
}
pub type wasm_exec_env_t = *mut WASMExecEnv;
pub const package_type_t_Wasm_Module_Bytecode: package_type_t = 0;
pub const package_type_t_Wasm_Module_AoT: package_type_t = 1;
pub const package_type_t_Package_Type_Unknown: package_type_t = 65535;
pub type package_type_t = ::std::os::raw::c_uint;
pub const mem_alloc_type_t_Alloc_With_Pool: mem_alloc_type_t = 0;
pub const mem_alloc_type_t_Alloc_With_Allocator: mem_alloc_type_t = 1;
pub const mem_alloc_type_t_Alloc_With_System_Allocator: mem_alloc_type_t = 2;
pub type mem_alloc_type_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union MemAllocOption {
    pub pool: MemAllocOption__bindgen_ty_1,
    pub allocator: MemAllocOption__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MemAllocOption__bindgen_ty_1 {
    pub heap_buf: *mut ::std::os::raw::c_void,
    pub heap_size: u32,
}
#[test]
fn bindgen_test_layout_MemAllocOption__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<MemAllocOption__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(MemAllocOption__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<MemAllocOption__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(MemAllocOption__bindgen_ty_1))
    );
    fn test_field_heap_buf() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MemAllocOption__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).heap_buf) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MemAllocOption__bindgen_ty_1),
                "::",
                stringify!(heap_buf)
            )
        );
    }
    test_field_heap_buf();
    fn test_field_heap_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MemAllocOption__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).heap_size) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MemAllocOption__bindgen_ty_1),
                "::",
                stringify!(heap_size)
            )
        );
    }
    test_field_heap_size();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MemAllocOption__bindgen_ty_2 {
    pub malloc_func: *mut ::std::os::raw::c_void,
    pub realloc_func: *mut ::std::os::raw::c_void,
    pub free_func: *mut ::std::os::raw::c_void,
    pub user_data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_MemAllocOption__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<MemAllocOption__bindgen_ty_2>(),
        32usize,
        concat!("Size of: ", stringify!(MemAllocOption__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<MemAllocOption__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(MemAllocOption__bindgen_ty_2))
    );
    fn test_field_malloc_func() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MemAllocOption__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).malloc_func) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MemAllocOption__bindgen_ty_2),
                "::",
                stringify!(malloc_func)
            )
        );
    }
    test_field_malloc_func();
    fn test_field_realloc_func() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MemAllocOption__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).realloc_func) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(MemAllocOption__bindgen_ty_2),
                "::",
                stringify!(realloc_func)
            )
        );
    }
    test_field_realloc_func();
    fn test_field_free_func() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MemAllocOption__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).free_func) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(MemAllocOption__bindgen_ty_2),
                "::",
                stringify!(free_func)
            )
        );
    }
    test_field_free_func();
    fn test_field_user_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MemAllocOption__bindgen_ty_2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).user_data) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(MemAllocOption__bindgen_ty_2),
                "::",
                stringify!(user_data)
            )
        );
    }
    test_field_user_data();
}
#[test]
fn bindgen_test_layout_MemAllocOption() {
    assert_eq!(
        ::std::mem::size_of::<MemAllocOption>(),
        32usize,
        concat!("Size of: ", stringify!(MemAllocOption))
    );
    assert_eq!(
        ::std::mem::align_of::<MemAllocOption>(),
        8usize,
        concat!("Alignment of ", stringify!(MemAllocOption))
    );
    fn test_field_pool() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MemAllocOption>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pool) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MemAllocOption),
                "::",
                stringify!(pool)
            )
        );
    }
    test_field_pool();
    fn test_field_allocator() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<MemAllocOption>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).allocator) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(MemAllocOption),
                "::",
                stringify!(allocator)
            )
        );
    }
    test_field_allocator();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mem_alloc_info_t {
    pub total_size: u32,
    pub total_free_size: u32,
    pub highmark_size: u32,
}
#[test]
fn bindgen_test_layout_mem_alloc_info_t() {
    assert_eq!(
        ::std::mem::size_of::<mem_alloc_info_t>(),
        12usize,
        concat!("Size of: ", stringify!(mem_alloc_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<mem_alloc_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(mem_alloc_info_t))
    );
    fn test_field_total_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<mem_alloc_info_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).total_size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(mem_alloc_info_t),
                "::",
                stringify!(total_size)
            )
        );
    }
    test_field_total_size();
    fn test_field_total_free_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<mem_alloc_info_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).total_free_size) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(mem_alloc_info_t),
                "::",
                stringify!(total_free_size)
            )
        );
    }
    test_field_total_free_size();
    fn test_field_highmark_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<mem_alloc_info_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).highmark_size) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(mem_alloc_info_t),
                "::",
                stringify!(highmark_size)
            )
        );
    }
    test_field_highmark_size();
}
pub const RunningMode_Mode_Interp: RunningMode = 1;
pub const RunningMode_Mode_Fast_JIT: RunningMode = 2;
pub const RunningMode_Mode_LLVM_JIT: RunningMode = 3;
pub const RunningMode_Mode_Multi_Tier_JIT: RunningMode = 4;
pub type RunningMode = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct RuntimeInitArgs {
    pub mem_alloc_type: mem_alloc_type_t,
    pub mem_alloc_option: MemAllocOption,
    pub native_module_name: *const ::std::os::raw::c_char,
    pub native_symbols: *mut NativeSymbol,
    pub n_native_symbols: u32,
    pub max_thread_num: u32,
    pub ip_addr: [::std::os::raw::c_char; 128usize],
    pub unused: ::std::os::raw::c_int,
    pub instance_port: ::std::os::raw::c_int,
    pub fast_jit_code_cache_size: u32,
    pub running_mode: RunningMode,
    pub llvm_jit_opt_level: u32,
    pub llvm_jit_size_level: u32,
}
#[test]
fn bindgen_test_layout_RuntimeInitArgs() {
    assert_eq!(
        ::std::mem::size_of::<RuntimeInitArgs>(),
        216usize,
        concat!("Size of: ", stringify!(RuntimeInitArgs))
    );
    assert_eq!(
        ::std::mem::align_of::<RuntimeInitArgs>(),
        8usize,
        concat!("Alignment of ", stringify!(RuntimeInitArgs))
    );
    fn test_field_mem_alloc_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RuntimeInitArgs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mem_alloc_type) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(RuntimeInitArgs),
                "::",
                stringify!(mem_alloc_type)
            )
        );
    }
    test_field_mem_alloc_type();
    fn test_field_mem_alloc_option() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RuntimeInitArgs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mem_alloc_option) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(RuntimeInitArgs),
                "::",
                stringify!(mem_alloc_option)
            )
        );
    }
    test_field_mem_alloc_option();
    fn test_field_native_module_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RuntimeInitArgs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).native_module_name) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(RuntimeInitArgs),
                "::",
                stringify!(native_module_name)
            )
        );
    }
    test_field_native_module_name();
    fn test_field_native_symbols() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RuntimeInitArgs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).native_symbols) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(RuntimeInitArgs),
                "::",
                stringify!(native_symbols)
            )
        );
    }
    test_field_native_symbols();
    fn test_field_n_native_symbols() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RuntimeInitArgs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).n_native_symbols) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(RuntimeInitArgs),
                "::",
                stringify!(n_native_symbols)
            )
        );
    }
    test_field_n_native_symbols();
    fn test_field_max_thread_num() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RuntimeInitArgs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).max_thread_num) as usize - ptr as usize
            },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(RuntimeInitArgs),
                "::",
                stringify!(max_thread_num)
            )
        );
    }
    test_field_max_thread_num();
    fn test_field_ip_addr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RuntimeInitArgs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ip_addr) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(RuntimeInitArgs),
                "::",
                stringify!(ip_addr)
            )
        );
    }
    test_field_ip_addr();
    fn test_field_unused() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RuntimeInitArgs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unused) as usize - ptr as usize
            },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(RuntimeInitArgs),
                "::",
                stringify!(unused)
            )
        );
    }
    test_field_unused();
    fn test_field_instance_port() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RuntimeInitArgs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).instance_port) as usize - ptr as usize
            },
            196usize,
            concat!(
                "Offset of field: ",
                stringify!(RuntimeInitArgs),
                "::",
                stringify!(instance_port)
            )
        );
    }
    test_field_instance_port();
    fn test_field_fast_jit_code_cache_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RuntimeInitArgs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fast_jit_code_cache_size) as usize - ptr as usize
            },
            200usize,
            concat!(
                "Offset of field: ",
                stringify!(RuntimeInitArgs),
                "::",
                stringify!(fast_jit_code_cache_size)
            )
        );
    }
    test_field_fast_jit_code_cache_size();
    fn test_field_running_mode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RuntimeInitArgs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).running_mode) as usize - ptr as usize
            },
            204usize,
            concat!(
                "Offset of field: ",
                stringify!(RuntimeInitArgs),
                "::",
                stringify!(running_mode)
            )
        );
    }
    test_field_running_mode();
    fn test_field_llvm_jit_opt_level() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RuntimeInitArgs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).llvm_jit_opt_level) as usize - ptr as usize
            },
            208usize,
            concat!(
                "Offset of field: ",
                stringify!(RuntimeInitArgs),
                "::",
                stringify!(llvm_jit_opt_level)
            )
        );
    }
    test_field_llvm_jit_opt_level();
    fn test_field_llvm_jit_size_level() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<RuntimeInitArgs>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).llvm_jit_size_level) as usize - ptr as usize
            },
            212usize,
            concat!(
                "Offset of field: ",
                stringify!(RuntimeInitArgs),
                "::",
                stringify!(llvm_jit_size_level)
            )
        );
    }
    test_field_llvm_jit_size_level();
}
pub type wasm_valkind_t = u8;
pub const wasm_valkind_enum_WASM_I32: wasm_valkind_enum = 0;
pub const wasm_valkind_enum_WASM_I64: wasm_valkind_enum = 1;
pub const wasm_valkind_enum_WASM_F32: wasm_valkind_enum = 2;
pub const wasm_valkind_enum_WASM_F64: wasm_valkind_enum = 3;
pub const wasm_valkind_enum_WASM_ANYREF: wasm_valkind_enum = 128;
pub const wasm_valkind_enum_WASM_FUNCREF: wasm_valkind_enum = 129;
pub type wasm_valkind_enum = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct wasm_val_t {
    pub kind: wasm_valkind_t,
    pub of: wasm_val_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union wasm_val_t__bindgen_ty_1 {
    pub i32_: i32,
    pub i64_: i64,
    pub f32_: f32,
    pub f64_: f64,
    pub foreign: usize,
}
#[test]
fn bindgen_test_layout_wasm_val_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<wasm_val_t__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(wasm_val_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<wasm_val_t__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(wasm_val_t__bindgen_ty_1))
    );
    fn test_field_i32() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<wasm_val_t__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).i32_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(wasm_val_t__bindgen_ty_1),
                "::",
                stringify!(i32_)
            )
        );
    }
    test_field_i32();
    fn test_field_i64() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<wasm_val_t__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).i64_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(wasm_val_t__bindgen_ty_1),
                "::",
                stringify!(i64_)
            )
        );
    }
    test_field_i64();
    fn test_field_f32() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<wasm_val_t__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).f32_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(wasm_val_t__bindgen_ty_1),
                "::",
                stringify!(f32_)
            )
        );
    }
    test_field_f32();
    fn test_field_f64() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<wasm_val_t__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).f64_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(wasm_val_t__bindgen_ty_1),
                "::",
                stringify!(f64_)
            )
        );
    }
    test_field_f64();
    fn test_field_foreign() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<wasm_val_t__bindgen_ty_1>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).foreign) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(wasm_val_t__bindgen_ty_1),
                "::",
                stringify!(foreign)
            )
        );
    }
    test_field_foreign();
}
#[test]
fn bindgen_test_layout_wasm_val_t() {
    assert_eq!(
        ::std::mem::size_of::<wasm_val_t>(),
        16usize,
        concat!("Size of: ", stringify!(wasm_val_t))
    );
    assert_eq!(
        ::std::mem::align_of::<wasm_val_t>(),
        8usize,
        concat!("Alignment of ", stringify!(wasm_val_t))
    );
    fn test_field_kind() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<wasm_val_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).kind) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(wasm_val_t),
                "::",
                stringify!(kind)
            )
        );
    }
    test_field_kind();
    fn test_field_of() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<wasm_val_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).of) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(wasm_val_t),
                "::",
                stringify!(of)
            )
        );
    }
    test_field_of();
}
extern "C" {
    #[doc = " Initialize the WASM runtime environment, and also initialize"]
    #[doc = " the memory allocator with system allocator, which calls os_malloc"]
    #[doc = " to allocate memory"]
    #[doc = ""]
    #[doc = " @return true if success, false otherwise"]
    pub fn wasm_runtime_init() -> bool;
}
extern "C" {
    #[doc = " Initialize the WASM runtime environment, WASM running mode,"]
    #[doc = " and also initialize the memory allocator and register native symbols,"]
    #[doc = " which are specified with init arguments"]
    #[doc = ""]
    #[doc = " @param init_args specifies the init arguments"]
    #[doc = ""]
    #[doc = " @return return true if success, false otherwise"]
    pub fn wasm_runtime_full_init(init_args: *mut RuntimeInitArgs) -> bool;
}
extern "C" {
